README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org7b3ea61)
2.  [Resumo e/ou informação extra:](#org5f30793)
3.  [Versão:](#org4a173d0)
4.  [Data:](#orgda9bc99)
5.  [Autor de Contato:](#org0d57de1)
6.  [Lista dos Autores:](#orgae098fd)
7.  [Áreas de pesquisa vinculadas:](#org48f44b3)
8.  [Vinculo com:](#org90079e9)
9.  [Paradigmas:](#org51a0509)
10. [Tipo de Interface:](#org9af3cba)
11. [Plataformas Suportadas:](#orgb1cbf1d)
12. [Linguagens Utilizadas:](#org75208e4)
13. [Bibliotecas Utilizadas (dependências):](#org0f48516)
14. [Softwares utilizados (dependências)](#org28489d8)
15. [Tipo de Licença:](#orgbf08c26)
16. [Links:](#orgf84235d)


<a id="org7b3ea61"></a>

# Nome do Software (ou Biblioteca):

-   MODELOS DE DESLOCAMENTO IMISCÍVEL PARA RECUPERAÇÃO

SECUNDÁRIA DE PETRÓLEO


<a id="org5f30793"></a>

# Resumo e/ou informação extra:

-   O projeto a ser desenvolvido consiste em um programa que calculará características

de um reservatório homogêneo a partir de um fluxo bifásico areal, preverá o desempenho
no processo de recuperação secundária do óleo a partir de um sistema estratificado com
fluxo bifásico.
A presente construção do sistema será utilizado em âmbito acadêmico como software
livre, a partir do uso da Programação Orientada a Objeto em C++ e software Gnuplot,
para que esteja disponível de fácil acesso a todos. A interface selecionada para o programa
é em modo texto, o usuário irá se relacionar a partir do uso do teclado, mouse e monitor
em conjunto com a interface do sistema construído. Os dados de entrada, propriedades do
reservatório, serão fornecidos em modo .xlsx, na qual poderá ser modificado pelo usuário
com base nas informações do reservatório em questão, enquanto que os dados de saída
serão em modo arquivo de texto .txt e imagem .png com base nos diferentes modelos de
deslocamento possíveis do software.


<a id="org4a173d0"></a>

# Versão:

-   1.0.


<a id="orgda9bc99"></a>

# Data:

-   2021/2 - segundo semestre.


<a id="org0d57de1"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgae098fd"></a>

# Lista dos Autores:

-   DAVID HENRIQUE LIMA DIAS
-   JULIA RANGEL RIBEIRO
-   MARCOS VINÍCIUS DE PAULA CHAIBEN
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org48f44b3"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de reservatório


<a id="org90079e9"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org51a0509"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org9af3cba"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgb1cbf1d"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org75208e4"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org0f48516"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org28489d8"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orgbf08c26"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orgf84235d"></a>

# Links:

